Documents/Замена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Замена</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказДоговор</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.МонтажСебестоимостьТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЗаказам</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиВВалюте</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиПоЗаказам</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВозврата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВыдачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаВозврат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДоходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаВыдача</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/МонтажСебестоимостьТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>МонтажСебестоимостьТоваров</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказДоговор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентами</Name>
			<Comment>Взаиморасчеты с контрагентами</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УДАЛИТЬ_Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТовараПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаБанковскойКартой</v8:Type>
						<v8:Type>cfg:DocumentRef.Замена</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТовараОтПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыСКонтрагентамиПоЗаказам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентамиПоЗаказам</Name>
			<Comment>Взаиморасчеты с контрагентами по заказам (розница)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Замена/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		
		ЗаполнитьПоЗаказДоговору(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Монтаж") Тогда
		
		ЗаполнитьПоЗаказДоговору(ДанныеЗаполнения.ЗаказДоговор);
		
	КонецЕсли;	
	
	СтатьяРасходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(ЭтотОбъект, "Расход", Ложь, Основание.Организация, Основание.Подразделение);
	СтатьяДоходов  = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(ЭтотОбъект, "Доход",      , Основание.Организация, Основание.Подразделение);
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	
	//проверки
	Если Основание.Пустая() Тогда
		Отказ = Истина;
		Сообщить("В документе следует указать заказ-договор");
		Возврат;
	КонецЕсли;
	Если НЕ Основание.Проведен Тогда
		Отказ = Истина;
		Сообщить("Заказ-договор, который является основанием, должен быть проведен");
		Возврат;
	КонецЕсли;
	
	//определим себестоимость всего товара, который был израсходован по заказ-договору (через документ "Монтаж" или "Реализация"
	ТаблицаСебестоимости = Новый ТаблицаЗначений;
	ТаблицаСебестоимости.Колонки.Добавить("Номенклатура");
	ТаблицаСебестоимости.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ТаблицаСебестоимости.Колонки.Добавить("СерияНоменклатуры");
	ТаблицаСебестоимости.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ТаблицаСебестоимости.Колонки.Добавить("Стоимость", Новый ОписаниеТипов("Число"));
	ТаблицаСебестоимости.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыНаСкладахОбороты.Номенклатура,
	|	ТоварыНаСкладахОбороты.ХарактеристикаНоменклатуры,
	|	ТоварыНаСкладахОбороты.СерияНоменклатуры,
	|	ТоварыНаСкладахОбороты.КоличествоРасход КАК Количество,
	|	ТоварыНаСкладахОбороты.СуммаРасход КАК Стоимость,
	|	ВЫБОР
	|		КОГДА НЕ ТоварыНаСкладахОбороты.КоличествоРасход = 0
	|			ТОГДА ТоварыНаСкладахОбороты.СуммаРасход / ТоварыНаСкладахОбороты.КоличествоРасход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Цена
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Обороты(, , Регистратор, ) КАК ТоварыНаСкладахОбороты
	|ГДЕ
	|	ТоварыНаСкладахОбороты.Регистратор.Основание = &Основание";
	Запрос.УстановитьПараметр("Основание", Основание);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаСебестоимости.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	ОрганизацияТоваров = Основание.Организация;
	Если Константы.ОбщиеСклады.Получить() Тогда
		ОрганизацияТоваров = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	//регистр ТоварыНаСкладах Расход + МонтажСебестоимостьТоваров
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.МонтажСебестоимостьТоваров.Записывать = Истина;
	ТаблицаСписанияТовары = ТаблицаВыдача.Выгрузить();
	ТаблицаСписанияТовары.Очистить();
	Для Каждого ТекущаяСтрока Из ТаблицаВыдача Цикл
		Если НЕ ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Услуга Тогда
			НоваяСтрока = ТаблицаСписанияТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЕсли;
	КонецЦикла;
	Если НЕ ТаблицаСписанияТовары.Количество() = 0 Тогда
		Отказ = НЕ Движения.ТоварыНаСкладах.КонтрольОстатков(Ссылка, ОрганизацияТоваров, Склад, ТаблицаСписанияТовары, Дата);
		Если Отказ Тогда
			Возврат;
		Иначе
			//++ №8793 нужно свернуть, чтобы корректно списать себестоимость
			ТаблицаСписанияТовары.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, ЕдиницаИзмерения, Коэффициент", "Количество"); 
			//-- №8793
			Для Каждого Товар Из ТаблицаСписанияТовары Цикл
				Расход = Движения.ТоварыНаСкладах.Добавить();
				Расход.ВидДвижения = ВидДвиженияНакопления.Расход;
				Расход.Период = Дата;
				Расход.Организация = ОрганизацияТоваров;
				Расход.Склад = Склад;
				Расход.Номенклатура = Товар.Номенклатура;
				Расход.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
				Расход.СерияНоменклатуры = Товар.СерияНоменклатуры;
				Расход.Количество = Товар.Количество * Товар.Коэффициент;
				//#8288
				//Расход.Сумма = Расход.Количество * Движения.ТоварыНаСкладах.ПолучитьЦенуОстаткаНоменклатуры(Дата, ОрганизацияТоваров, Склад, Расход.Номенклатура, Расход.ХарактеристикаНоменклатуры, Расход.СерияНоменклатуры);
				СтруктураЦенОстатков = Движения.ТоварыНаСкладах.ПолучитьЦеныОстаткаНоменклатуры(Дата, ОрганизацияТоваров, Склад, Расход.Номенклатура, Расход.ХарактеристикаНоменклатуры, Расход.СерияНоменклатуры);
				Расход.Сумма = Расход.Количество * СтруктураЦенОстатков.Цена;
				Расход.СуммаВал = Расход.Количество * СтруктураЦенОстатков.ЦенаВал;
		
				Если НЕ Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(Товар.Номенклатура) Тогда
					РасходТовары = Движения.МонтажСебестоимостьТоваров.Добавить();
					ЗаполнитьЗначенияСвойств(РасходТовары, Расход);
					РасходТовары.ЗаказДоговор = Основание;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	//регистр ТоварыНаСкладах Приход + МонтажСебестоимостьТоваров
	ТаблицаПолученияТовары = ТаблицаВозврат.Выгрузить();
	ТаблицаПолученияТовары.Очистить();
	Для Каждого ТекущаяСтрока Из ТаблицаВозврат Цикл
		Если НЕ ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Услуга Тогда
			НоваяСтрока = ТаблицаПолученияТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура", НоваяСтрока.Номенклатура);
			Отбор.Вставить("ХарактеристикаНоменклатуры", НоваяСтрока.ХарактеристикаНоменклатуры);
			Отбор.Вставить("СерияНоменклатуры", НоваяСтрока.СерияНоменклатуры);
			НайденныеСтроки = ТаблицаСебестоимости.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 Тогда
				//нашли себестоимость в списанных товарах по заказ-договору
				НоваяСтрока.Сумма = НоваяСтрока.Количество * НайденныеСтроки[0].Цена
			Иначе
				//не нашли, оставляем стоимость ту, по которой возвращаем
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если НЕ ТаблицаПолученияТовары.Количество() = 0 Тогда
			Для Каждого Товар Из ТаблицаПолученияТовары Цикл
				Приход = Движения.ТоварыНаСкладах.Добавить();
				Приход.ВидДвижения = ВидДвиженияНакопления.Приход;
				Приход.Период = Дата;
				Приход.Организация = ОрганизацияТоваров;
				Приход.Склад = Склад;
				Приход.Номенклатура = Товар.Номенклатура;
				Приход.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
				Приход.СерияНоменклатуры = Товар.СерияНоменклатуры;
				Приход.Количество = Товар.Количество * Товар.Коэффициент;
				//Приход.Сумма = Товар.Сумма;
				Приход.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Товар.Сумма);
				Приход.СуммаВал = РаботаСВалютой.ПолучитьСуммуВДопВалютеУчетаПоДокументу(Ссылка, Товар.Сумма); //#8288
				
				Если НЕ Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(Товар.Номенклатура) Тогда
					ПриходТовары = Движения.МонтажСебестоимостьТоваров.Добавить();
					ЗаполнитьЗначенияСвойств(ПриходТовары, Приход);
					ПриходТовары.ЗаказДоговор = Основание;
					ПриходТовары.Количество = -ПриходТовары.Количество;
					ПриходТовары.Сумма = -ПриходТовары.Сумма;
				КонецЕсли;
			КонецЦикла;
	КонецЕсли;

	
	// регистр ВзаиморасчетыСКонтрагентами Приход
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Организация = Основание.Организация;
	Движение.Контрагент = Основание.Контрагент;
	Движение.Договор = Основание.ДоговорКонтрагента;
	//Движение.Документ = Ссылка;
	Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, СуммаВыдачи);
	// регистр ВзаиморасчетыСКонтрагентами Расход
	Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Организация = Основание.Организация;
	Движение.Контрагент = Основание.Контрагент;
	Движение.Договор = Основание.ДоговорКонтрагента;
	//Движение.Документ = Ссылка;
	Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, СуммаВозврата);
	
	//регистр ВзаиморасчетыСКонтрагентамиВВалюте Приход
	Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Записывать = Истина;
	Движение = Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Добавить();
	Движение.ВидДвижения =ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Организация = Основание.Организация;
	Движение.Контрагент = Основание.Контрагент;
	Движение.Договор = Основание.ДоговорКонтрагента;
	Движение.Валюта = Основание.Валюта;
	Движение.Сумма = СуммаВыдачи;
	//регистр ВзаиморасчетыСКонтрагентамиВВалюте Расход
	Движение = Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Добавить();
	Движение.ВидДвижения =ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Организация = Основание.Организация;
	Движение.Контрагент = Основание.Контрагент;
	Движение.Договор = Основание.ДоговорКонтрагента;
	Движение.Валюта = Основание.Валюта;
	Движение.Сумма = СуммаВозврата;
	
	// регистр ВзаиморасчетыСКонтрагентамиПоЗаказам Приход
	Движения.ВзаиморасчетыСКонтрагентамиПоЗаказам.Записывать = Истина;
	Движение = Движения.ВзаиморасчетыСКонтрагентамиПоЗаказам.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Заказ = Основание;
	Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, СуммаВыдачи);
	// регистр ВзаиморасчетыСКонтрагентамиПоЗаказам Расход
	Движение = Движения.ВзаиморасчетыСКонтрагентамиПоЗаказам.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Заказ = Основание;
	Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, СуммаВозврата);
	
	//регистр Продажи приход
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	Движения.Продажи.Записывать = Истина;		
	Для Каждого ТекущаяСтрока Из ТаблицаВыдача Цикл
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		
		Движение.Организация = Основание.Организация;
		Движение.Контрагент = Основание.Контрагент;
		Движение.ДоговорКонтрагента = Основание.ДоговорКонтрагента;
		Движение.ДокументПродажи = Ссылка;
		Движение.Склад = Склад; //#12367
		
		Движение.Номенклатура = ТекущаяСтрока.Номенклатура;
		Движение.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
		Движение.СерияНоменклатуры = ТекущаяСтрока.СерияНоменклатуры;
		
		Движение.ЕдиницаИзмерения = ТекущаяСтрока.ЕдиницаИзмерения;         //#14300
		Движение.КоличествоВЕдиницахДокумента = ТекущаяСтрока.Количество;	//#14300
		
		Движение.Количество = ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент;
		Движение.Сумма = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(Основание.Валюта, ВалютаУчета, Дата, ТекущаяСтрока.Сумма);
		Движение.СуммаВал = РаботаСВалютой.ПолучитьСуммуВДопВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма, Основание.Валюта); //#8288
	КонецЦикла;
	//регистр Продажи расход
	Для Каждого ТекущаяСтрока Из ТаблицаВозврат Цикл
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		
		Движение.Организация = Основание.Организация;
		Движение.Контрагент = Основание.Контрагент;
		Движение.ДоговорКонтрагента = Основание.ДоговорКонтрагента;
		Движение.ДокументПродажи = Ссылка;
		Движение.Склад = Склад; //#12367
		
		Движение.Номенклатура = ТекущаяСтрока.Номенклатура;
		Движение.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
		Движение.СерияНоменклатуры = ТекущаяСтрока.СерияНоменклатуры;
		
		Движение.ЕдиницаИзмерения = ТекущаяСтрока.ЕдиницаИзмерения;         //#14300
		Движение.КоличествоВЕдиницахДокумента = -ТекущаяСтрока.Количество;	//#14300
		
		Движение.Количество = -ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент;
		Движение.Сумма = -РаботаСВалютой.ПересчитатьИзВалютыВВалюту(Основание.Валюта, ВалютаУчета, Дата, ТекущаяСтрока.Сумма);
		Движение.СуммаВал = -РаботаСВалютой.ПолучитьСуммуВДопВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма, Основание.Валюта); //#8288
	КонецЦикла;
	
	// регистр РасчетыПоЗаказам Расход
	Движения.РасчетыПоЗаказам.Записывать = Истина;
	Движение = Движения.РасчетыПоЗаказам.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Заказ = Основание;
	Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Основание, СуммаВозврата);
	Движение.Контрагент = Основание.Контрагент; // №6496 добавлен контрагент в измерение
	// регистр РасчетыПоЗаказам Приход
	Движение = Движения.РасчетыПоЗаказам.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Заказ = Основание;
	Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Основание, СуммаВыдачи);
	Движение.Контрагент = Основание.Контрагент; // №6496 добавлен контрагент в измерение
	
	Если ПараметрыСеанса.ФинРезультатИспользоватьВедениеУчетаДоходовРасходов Тогда
		Если ПараметрыСеанса.ФинРезультатНеКассовыйМетодВеденияУчетаДоходовРасходов Тогда
			//некассовый метод
			Метод = Перечисления.МетодыВеденияУчетаДоходовРасходов.Некассовый;
			Движения.ДоходыРасходы.Записывать = Истина;			 
			Для Каждого ТекущаяСтрока Из ТаблицаВозврат Цикл
				Статья = ?(НЕ ТекущаяСтрока.СтатьяДоходов.Пустая(), ТекущаяСтрока.СтатьяДоходов, СтатьяДоходов);
				Если Статья.Пустая() ИЛИ ТекущаяСтрока.Сумма = 0 Тогда
					Продолжить;
				КонецЕсли;
				Движение = Движения.ДоходыРасходы.Добавить();
				Движение.Период 		= Дата;
				Движение.Организация 	= Основание.Организация;
				Движение.Подразделение 	= Основание.Подразделение;
				Движение.Статья 		= Статья;
				Движение.Метод		 	= Метод;
				Движение.СуммаДоходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма);
				Движение.СуммаРасходов 	= 0;					
			КонецЦикла;			 			
			Для Каждого ТекущаяСтрока Из ТаблицаВыдача Цикл
				Статья = ?(НЕ ТекущаяСтрока.СтатьяРасходов.Пустая(), ТекущаяСтрока.СтатьяРасходов, СтатьяДоходов);
				Если Статья.Пустая() ИЛИ ТекущаяСтрока.Сумма = 0 Тогда
					Продолжить;
				КонецЕсли;				
				Движение = Движения.ДоходыРасходы.Добавить();
				Движение.Период 		= Дата;
				Движение.Организация 	= Основание.Организация;
				Движение.Подразделение 	= Основание.Подразделение;
				Движение.Статья 		= Статья;
				Движение.Метод		 	= Метод;
				Движение.СуммаДоходов 	= 0;
				Движение.СуммаРасходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма);				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ЗаполнитьПоЗаказДоговору(ДанныеЗаполнения)

	Основание = ДанныеЗаполнения.Ссылка;
	Для Каждого СтрокаОснования Из ДанныеЗаполнения.ТоварыУслуги Цикл
		Если НЕ Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(СтрокаОснования.Номенклатура) Тогда
			НоваяСтрока = ТаблицаВозврат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОснования);
		КонецЕсли;
	КонецЦикла;
	
	СуммаВозврата = ТаблицаВозврат.Итог("Сумма");
	СуммаВыдачи = ТаблицаВыдача.Итог("Сумма");
	СуммаДокумента = СуммаВыдачи - СуммаВозврата;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
